#1 
print("Задача №1")
x = int(input("Введите число: "))
y = 7 * x + 5
print("Ответ: y =",y)

#2
print("Задача №2")
a = int(input("Введите число: "))
P = a * 4
print("Ответ: Периметр =",P)
#3
print("Задача №3")
r = int(input("Введите число: "))
L = 2 * 3.14 * r
print("Ответ: L =",L)
#4 
print("Задача №4")
d = int(input("Введите число: "))
S = d ** 2 // 4 * 3.14
print("Ответ: ",S)
#5
print("Задача №5")
a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = 0.5 ** (a ** 2 + b ** 2)
print("Ответ: ",c)
#6
print("Задача №6")
a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = 0.5 ** (a ** 2 + b ** 2)
P = a + b + c
print("Ответ: ",P)
#7
print("Задача №7")
a = int(input("Введите число: "))
b = int(input("Введите число: "))
P = 2 * a + 2 * b 
d = 0.5 ** (a ** 2 + b ** 2)
print("Ответ: периметр = ",P, "Диагональ = ",d)
#8 
print("Задача №8")
R = int(input("Введите число: "))
r = int(input("Введите число: "))
S = (R ** 2 - r ** 2) * 3.14
print("Ответ: ",S)
#9 
print("Задача №9")
rebro = int(input("Введите число: "))
S = 6 * rebro ** 2
V = rebro ** 3 
print("Ответ: Площадь поверхности = ",S, "Объём = ", V)
#9
print("Задача №10")
a = int(input("Введите число: "))
b = int(input("Введите число: "))
h = int(input("Введите число: "))
c = h * 2 + ((a - b) // 2) * 2
P = a + b + 2 * c
print("Ответ: ",P)